; domain
(define (domain drone)

    ;remove requirements that are not needed
    ;(:requirements :strips)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        location - object
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (visited ?x - location)
    )
    (:functions
        (x)
        (y)
        (z)
        (xl ?l - location)
        (yl ?l - location)
        (zl ?l - location)
        (battery-level)
        (battery-level-full)
        (min_x)
        (max_x)
        (min_y)
        (max_y)
        (min_z)
        (max_z)
    )

    (:action increase_x
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (x) (- (max_x) 1))
        )
        :effect (and (increase (x) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action decrease_x
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (x) (+ (min_x) 1))
        )
        :effect (and (decrease (x) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action increase_y
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (y) (- (max_y) 1))
        )
        :effect (and (increase (y) 1)
            (decrease (battery-level) 1)
        )
    )
    (:action decrease_y
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (y) (+ (min_y) 1))
        )
        :effect (and (decrease (y) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action increase_z
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (z) (- (max_z) 1))
        )
        :effect (and (increase (z) 1)
            (decrease (battery-level) 1)
        )
    )
    (:action decrease_z
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (z) (+ (min_z) 1))
        )
        :effect (and (decrease (z) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action visit
        :parameters (?l - location)
        :precondition (and
            (>= (battery-level) 1)
            (= (xl ?l) (x))
            (= (yl ?l) (y))
            (= (zl ?l) (z))
        )
        :effect (and (visited ?l)
            (decrease (battery-level) 1))
    )

    (:action recharge
        :parameters ()
        :precondition (and
            (= (x) 0)
            (= (y) 0)
            (= (z) 0)
        )
        :effect (and
            (assign (battery-level) (battery-level-full)))
    )

)

; problem
;;Instance with 8x1x2 points
(define (problem name) (:domain drone)
(:objects
x0y0z0 - location
x0y0z1 - location
x1y0z0 - location
x1y0z1 - location
x2y0z0 - location
x2y0z1 - location
x3y0z0 - location
x3y0z1 - location
x4y0z0 - location
x4y0z1 - location
x5y0z0 - location
x5y0z1 - location
x6y0z0 - location
x6y0z1 - location
x7y0z0 - location
x7y0z1 - location
)
(:init (= (x) 0) (= (y) 0) (= (z) 0)
 (= (min_x) 0)  (= (max_x) 8)
 (= (min_y) 0)  (= (max_y) 1)
 (= (min_z) 0)  (= (max_z) 2)
(= (xl x0y0z0) 0)
(= (yl x0y0z0) 0)
(= (zl x0y0z0) 0)
(= (xl x0y0z1) 0)
(= (yl x0y0z1) 0)
(= (zl x0y0z1) 1)
(= (xl x1y0z0) 1)
(= (yl x1y0z0) 0)
(= (zl x1y0z0) 0)
(= (xl x1y0z1) 1)
(= (yl x1y0z1) 0)
(= (zl x1y0z1) 1)
(= (xl x2y0z0) 2)
(= (yl x2y0z0) 0)
(= (zl x2y0z0) 0)
(= (xl x2y0z1) 2)
(= (yl x2y0z1) 0)
(= (zl x2y0z1) 1)
(= (xl x3y0z0) 3)
(= (yl x3y0z0) 0)
(= (zl x3y0z0) 0)
(= (xl x3y0z1) 3)
(= (yl x3y0z1) 0)
(= (zl x3y0z1) 1)
(= (xl x4y0z0) 4)
(= (yl x4y0z0) 0)
(= (zl x4y0z0) 0)
(= (xl x4y0z1) 4)
(= (yl x4y0z1) 0)
(= (zl x4y0z1) 1)
(= (xl x5y0z0) 5)
(= (yl x5y0z0) 0)
(= (zl x5y0z0) 0)
(= (xl x5y0z1) 5)
(= (yl x5y0z1) 0)
(= (zl x5y0z1) 1)
(= (xl x6y0z0) 6)
(= (yl x6y0z0) 0)
(= (zl x6y0z0) 0)
(= (xl x6y0z1) 6)
(= (yl x6y0z1) 0)
(= (zl x6y0z1) 1)
(= (xl x7y0z0) 7)
(= (yl x7y0z0) 0)
(= (zl x7y0z0) 0)
(= (xl x7y0z1) 7)
(= (yl x7y0z1) 0)
(= (zl x7y0z1) 1)
(= (battery-level) 23)
(= (battery-level-full) 23)
)
(:goal (and
(visited x0y0z0)
(visited x0y0z1)
(visited x1y0z0)
(visited x1y0z1)
(visited x2y0z0)
(visited x2y0z1)
(visited x3y0z0)
(visited x3y0z1)
(visited x4y0z0)
(visited x4y0z1)
(visited x5y0z0)
(visited x5y0z1)
(visited x6y0z0)
(visited x6y0z1)
(visited x7y0z0)
(visited x7y0z1)
(= (x) 0) (= (y) 0) (= (z) 0) ))
);; end of the problem instance

; plan
1. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 23 to 22
   goals met: 2 of 19
2. (increase_x)
   changed: (x) from 1 to 2, (battery-level) from 22 to 21
   goals met: 2 of 19
3. (increase_x)
   changed: (x) from 2 to 3, (battery-level) from 21 to 20
   goals met: 2 of 19
4. (visit x3y0z0)
   added: (visited x3y0z0)
   changed: (battery-level) from 20 to 19
   goals met: 3 of 19
5. (increase_z)
   changed: (z) from 0 to 1, (battery-level) from 19 to 18
   goals met: 2 of 19
6. (visit x3y0z1)
   added: (visited x3y0z1)
   changed: (battery-level) from 18 to 17
   goals met: 3 of 19
7. (increase_x)
   changed: (x) from 3 to 4, (battery-level) from 17 to 16
   goals met: 3 of 19
8. (decrease_z)
   changed: (z) from 1 to 0, (battery-level) from 16 to 15
   goals met: 4 of 19
9. (visit x4y0z0)
   added: (visited x4y0z0)
   changed: (battery-level) from 15 to 14
   goals met: 5 of 19
10. (increase_z)
   changed: (z) from 0 to 1, (battery-level) from 14 to 13
   goals met: 4 of 19
11. (visit x4y0z1)
   added: (visited x4y0z1)
   changed: (battery-level) from 13 to 12
   goals met: 5 of 19
12. (decrease_x)
   changed: (x) from 4 to 3, (battery-level) from 12 to 11
   goals met: 5 of 19
13. (decrease_x)
   changed: (x) from 3 to 2, (battery-level) from 11 to 10
   goals met: 5 of 19
14. (decrease_z)
   changed: (z) from 1 to 0, (battery-level) from 10 to 9
   goals met: 6 of 19
15. (visit x2y0z0)
   added: (visited x2y0z0)
   changed: (battery-level) from 9 to 8
   goals met: 7 of 19
16. (increase_z)
   changed: (z) from 0 to 1, (battery-level) from 8 to 7
   goals met: 6 of 19
17. (visit x2y0z1)
   added: (visited x2y0z1)
   changed: (battery-level) from 7 to 6
   goals met: 7 of 19
18. (decrease_x)
   changed: (x) from 2 to 1, (battery-level) from 6 to 5
   goals met: 7 of 19
19. (visit x1y0z1)
   added: (visited x1y0z1)
   changed: (battery-level) from 5 to 4
   goals met: 8 of 19
20. (decrease_z)
   changed: (z) from 1 to 0, (battery-level) from 4 to 3
   goals met: 9 of 19
21. (visit x1y0z0)
   added: (visited x1y0z0)
   changed: (battery-level) from 3 to 2
   goals met: 10 of 19
22. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 2 to 1
   goals met: 11 of 19
23. (recharge)
   changed: (battery-level) from 1 to 23
   goals met: 11 of 19
24. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 23 to 22
   goals met: 10 of 19
25. (increase_x)
   changed: (x) from 1 to 2, (battery-level) from 22 to 21
   goals met: 10 of 19
26. (increase_x)
   changed: (x) from 2 to 3, (battery-level) from 21 to 20
   goals met: 10 of 19
27. (increase_x)
   changed: (x) from 3 to 4, (battery-level) from 20 to 19
   goals met: 10 of 19
28. (increase_x)
   changed: (x) from 4 to 5, (battery-level) from 19 to 18
   goals met: 10 of 19
29. (visit x5y0z0)
   added: (visited x5y0z0)
   changed: (battery-level) from 18 to 17
   goals met: 11 of 19
30. (increase_z)
   changed: (z) from 0 to 1, (battery-level) from 17 to 16
   goals met: 10 of 19
31. (visit x5y0z1)
   added: (visited x5y0z1)
   changed: (battery-level) from 16 to 15
   goals met: 11 of 19
32. (increase_x)
   changed: (x) from 5 to 6, (battery-level) from 15 to 14
   goals met: 11 of 19
33. (decrease_z)
   changed: (z) from 1 to 0, (battery-level) from 14 to 13
   goals met: 12 of 19
34. (visit x6y0z0)
   added: (visited x6y0z0)
   changed: (battery-level) from 13 to 12
   goals met: 13 of 19
35. (increase_z)
   changed: (z) from 0 to 1, (battery-level) from 12 to 11
   goals met: 12 of 19
36. (visit x6y0z1)
   added: (visited x6y0z1)
   changed: (battery-level) from 11 to 10
   goals met: 13 of 19
37. (decrease_x)
   changed: (x) from 6 to 5, (battery-level) from 10 to 9
   goals met: 13 of 19
38. (decrease_x)
   changed: (x) from 5 to 4, (battery-level) from 9 to 8
   goals met: 13 of 19
39. (decrease_x)
   changed: (x) from 4 to 3, (battery-level) from 8 to 7
   goals met: 13 of 19
40. (decrease_x)
   changed: (x) from 3 to 2, (battery-level) from 7 to 6
   goals met: 13 of 19
41. (decrease_x)
   changed: (x) from 2 to 1, (battery-level) from 6 to 5
   goals met: 13 of 19
42. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 5 to 4
   goals met: 14 of 19
43. (visit x0y0z1)
   added: (visited x0y0z1)
   changed: (battery-level) from 4 to 3
   goals met: 15 of 19
44. (decrease_z)
   changed: (z) from 1 to 0, (battery-level) from 3 to 2
   goals met: 16 of 19
45. (visit x0y0z0)
   added: (visited x0y0z0)
   changed: (battery-level) from 2 to 1
   goals met: 17 of 19
46. (recharge)
   changed: (battery-level) from 1 to 23
   goals met: 17 of 19
47. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 23 to 22
   goals met: 16 of 19
48. (increase_x)
   changed: (x) from 1 to 2, (battery-level) from 22 to 21
   goals met: 16 of 19
49. (increase_x)
   changed: (x) from 2 to 3, (battery-level) from 21 to 20
   goals met: 16 of 19
50. (increase_x)
   changed: (x) from 3 to 4, (battery-level) from 20 to 19
   goals met: 16 of 19
51. (increase_x)
   changed: (x) from 4 to 5, (battery-level) from 19 to 18
   goals met: 16 of 19
52. (increase_x)
   changed: (x) from 5 to 6, (battery-level) from 18 to 17
   goals met: 16 of 19
53. (increase_x)
   changed: (x) from 6 to 7, (battery-level) from 17 to 16
   goals met: 16 of 19
54. (visit x7y0z0)
   added: (visited x7y0z0)
   changed: (battery-level) from 16 to 15
   goals met: 17 of 19
55. (increase_z)
   changed: (z) from 0 to 1, (battery-level) from 15 to 14
   goals met: 16 of 19
56. (visit x7y0z1)
   added: (visited x7y0z1)
   changed: (battery-level) from 14 to 13
   goals met: 17 of 19
57. (decrease_x)
   changed: (x) from 7 to 6, (battery-level) from 13 to 12
   goals met: 17 of 19
58. (decrease_x)
   changed: (x) from 6 to 5, (battery-level) from 12 to 11
   goals met: 17 of 19
59. (decrease_x)
   changed: (x) from 5 to 4, (battery-level) from 11 to 10
   goals met: 17 of 19
60. (decrease_x)
   changed: (x) from 4 to 3, (battery-level) from 10 to 9
   goals met: 17 of 19
61. (decrease_x)
   changed: (x) from 3 to 2, (battery-level) from 9 to 8
   goals met: 17 of 19
62. (decrease_x)
   changed: (x) from 2 to 1, (battery-level) from 8 to 7
   goals met: 17 of 19
63. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 7 to 6
   goals met: 18 of 19
64. (decrease_z)
   changed: (z) from 1 to 0, (battery-level) from 6 to 5
   goals met: 19 of 19
